app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
  def userlist
    if user_signed_in?
      @users = User.all

SELECT  "posts".* FROM "posts"  ORDER BY created_at desc LIMIT 9 OFFSET 0
---
  def home
    @posts = Post.paginate(:page => params[:page], :per_page => 9).order('created_at desc')