app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @categories_list = Category.all